In [1]:
import pandas as p

In [10]:
a=p.Series([1.56,2.3,3,4,"hello papa"])

a

0          1.56
1           2.3
2             3
3             4
4    hello papa
dtype: object

In [11]:
type(a)

pandas.core.series.Series

In [16]:
a=p.Series([10,20,30,40])

a[0:7]

0    10
1    20
2    30
3    40
dtype: int64

In [21]:
a=[[[1,2],[20,30],[40,50]]],Columns=   ,g","g"]
b=p.DataFrame(a)
b

SyntaxError: can't assign to literal (<ipython-input-21-884b95c9b9ec>, line 1)

In [22]:
d={"name":["a","b","c","d"],"age":[90,60,90,40],"marks":[89,56,89,30]}
g=p.DataFrame(d)
g

  name  age  marks
0    a   90     89
1    b   60     56
2    c   90     89
3    d   40     30

In [42]:
g[:]
g[0:]

  name  age  marks
0    a   90     89
1    b   60     56
2    c   90     89
3    d   40     30

In [41]:
type(m)

pandas.core.series.Series

In [48]:
g.loc[4:,:]

Empty DataFrame
Columns: [name, age, marks]
Index: []

In [49]:
g.set_index('name')

      age  marks
name
a      90     89
b      60     56
c      90     89
d      40     30

In [54]:
g.iloc[1:]

  name  age  marks
1    b   60     56
2    c   90     89
3    d   40     30

In [61]:
g.drop('marks',axis=1)
g

  name  age  marks
0    a   90    100
1    b   60     20
2    c   90     30
3    d   40     40

In [57]:
g["marks"]=[100,20,30,40]
g

  name  age  marks
0    a   90    100
1    b   60     20
2    c   90     30
3    d   40     40

In [62]:
g.drop(1)

  name  age  marks
0    a   90    100
2    c   90     30
3    d   40     40

In [79]:
m=DataFrame.append("name":"fg","age":45,"marks":2)
m

SyntaxError: invalid syntax (<ipython-input-79-e7c6d083acf5>, line 1)